frank0165/McuDspGit20250505/mcu_project__debug_fordsp/src/mcu/GDE501_fireware/Firmware/GD32E501_standard_peripheral/Include/gd32e501_cla.h
/*!
    \file  gd32e501_cla.h
    \brief definitions for the CLA
    
    \version 2020-03-02, V1.0.0, firmware for GD32E501
    \version 2020-04-10, V1.0.1, firmware for GD32E501
*/

/*
    Copyright (c) 2020, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification, 
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this 
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice, 
       this list of conditions and the following disclaimer in the documentation 
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors 
       may be used to endorse or promote products derived from this software without 
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" 
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED 
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. 
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, 
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT 
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR 
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, 
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) 
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY 
OF SUCH DAMAGE.
*/

#ifndef GD32E501_CLA_H
#define GD32E501_CLA_H

#include "gd32e501.h"

/*CLA definitions */
#define CLA                                CLA_BASE

/* registers definitions */
#define CLA_GCTL                           REG32((CLA) + 0x00000000U)                              /*!< CLA global control register */
#define CLA_INTE                           REG32((CLA) + 0x00000004U)                              /*!< CLA interrupt flag enable register */
#define CLA_INTF                           REG32((CLA) + 0x00000008U)                              /*!< CLA interrupt flag register */
#define CLA_STAT                           REG32((CLA) + 0x0000000CU)                              /*!< CLA status register */
#define CLA_SIGS(CLAx)                     REG32((CLA) + 0x00000010U + ((CLAx) * 0x0000000CU))     /*!< CLA multiplexer selection register */
#define CLA_LCUCTL(CLAx)                   REG32((CLA) + 0x00000014U + ((CLAx) * 0x0000000CU))     /*!< CLA LCU control register */
#define CLA_CTL(CLAx)                      REG32((CLA) + 0x00000018U + ((CLAx) * 0x0000000CU))     /*!< CLA control register */

/* bits definitions */
/* CLA_GCTL */
#define CLA_GCTL_CLA0EN                    BIT(0)                           /*!< CLA0 unit enable */
#define CLA_GCTL_CLA1EN                    BIT(1)                           /*!< CLA1 unit enable */
#define CLA_GCTL_CLA2EN                    BIT(2)                           /*!< CLA2 unit enable */
#define CLA_GCTL_CLA3EN                    BIT(3)                           /*!< CLA3 unit enable */
#define CLA_GCTL_CLA4EN                    BIT(4)                           /*!< CLA4 unit enable */
#define CLA_GCTL_CLA5EN                    BIT(5)                           /*!< CLA5 unit enable */
#define CLA_GCTL_CLA6EN                    BIT(6)                           /*!< CLA6 unit enable */
#define CLA_GCTL_CLA7EN                    BIT(7)                           /*!< CLA7 unit enable */

/* CLA_INTE */
#define CLA_INTE_CLA0NIE                   BIT(0)                           /*!< CLA0 uint negedge interrupt enable */
#define CLA_INTE_CLA0PIE                   BIT(1)                           /*!< CLA0 uint posedge interrupt enable */
#define CLA_INTE_CLA1NIE                   BIT(2)                           /*!< CLA1 uint negedge interrupt enable */
#define CLA_INTE_CLA1PIE                   BIT(3)                           /*!< CLA1 uint posedge interrupt enable */
#define CLA_INTE_CLA2NIE                   BIT(4)                           /*!< CLA2 uint negedge interrupt enable */
#define CLA_INTE_CLA2PIE                   BIT(5)                           /*!< CLA2 uint posedge interrupt enable */
#define CLA_INTE_CLA3NIE                   BIT(6)                           /*!< CLA3 uint negedge interrupt enable */
#define CLA_INTE_CLA3PIE                   BIT(7)                           /*!< CLA3 uint posedge interrupt enable */
#define CLA_INTE_CLA4NIE                   BIT(8)                           /*!< CLA4 uint negedge interrupt enable */
#define CLA_INTE_CLA4PIE                   BIT(9)                           /*!< CLA4 uint posedge interrupt enable */
#define CLA_INTE_CLA5NIE                   BIT(10)                          /*!< CLA5 uint negedge interrupt enable */
#define CLA_INTE_CLA5PIE                   BIT(11)                          /*!< CLA5 uint posedge interrupt enable */
#define CLA_INTE_CLA6NIE                   BIT(12)                          /*!< CLA6 uint negedge interrupt enable */
#define CLA_INTE_CLA6PIE                   BIT(13)                          /*!< CLA6 uint posedge interrupt enable */
#define CLA_INTE_CLA7NIE                   BIT(14)                          /*!< CLA7 uint negedge interrupt enable */
#define CLA_INTE_CLA7PIE                   BIT(15)                          /*!< CLA7 uint posedge interrupt enable */

/* CLA_INTF */
#define CLA_INTF_CLA0NF                    BIT(0)                           /*!< CLA0 uint negedge flag */
#define CLA_INTF_CLA0PF                    BIT(1)                           /*!< CLA0 uint posedge flag */
#define CLA_INTF_CLA1NF                    BIT(2)                           /*!< CLA1 uint negedge flag */
#define CLA_INTF_CLA1PF                    BIT(3)                           /*!< CLA1 uint posedge flag */
#define CLA_INTF_CLA2NF                    BIT(4)                           /*!< CLA2 uint negedge flag */
#define CLA_INTF_CLA2PF                    BIT(5)                           /*!< CLA2 uint posedge flag */
#define CLA_INTF_CLA3NF                    BIT(6)                           /*!< CLA3 uint negedge flag */
#define CLA_INTF_CLA3PF                    BIT(7)                           /*!< CLA3 uint posedge flag */
#define CLA_INTF_CLA4NF                    BIT(8)                           /*!< CLA4 uint negedge flag */
#define CLA_INTF_CLA4PF                    BIT(9)                           /*!< CLA4 uint posedge flag */
#define CLA_INTF_CLA5NF                    BIT(10)                          /*!< CLA5 uint negedge flag */
#define CLA_INTF_CLA5PF                    BIT(11)                          /*!< CLA5 uint posedge flag */
#define CLA_INTF_CLA6NF                    BIT(12)                          /*!< CLA6 uint negedge flag */
#define CLA_INTF_CLA6PF                    BIT(13)                          /*!< CLA6 uint posedge flag */
#define CLA_INTF_CLA7NF                    BIT(14)                          /*!< CLA7 uint negedge flag */
#define CLA_INTF_CLA7PF                    BIT(15)                          /*!< CLA7 uint posedge flag */

/* CLA_STAT */
#define CLA_STAT_CLA0OUT                   BIT(0)                           /*!< CLA0 unit output state */
#define CLA_STAT_CLA1OUT                   BIT(1)                           /*!< CLA1 unit output state */
#define CLA_STAT_CLA2OUT                   BIT(2)                           /*!< CLA2 unit output state */
#define CLA_STAT_CLA3OUT                   BIT(3)                           /*!< CLA3 unit output state */
#define CLA_STAT_CLA4OUT                   BIT(4)                           /*!< CLA4 unit output state */
#define CLA_STAT_CLA5OUT                   BIT(5)                           /*!< CLA5 unit output state */
#define CLA_STAT_CLA6OUT                   BIT(6)                           /*!< CLA6 unit output state */
#define CLA_STAT_CLA7OUT                   BIT(7)                           /*!< CLA7 unit output state */

/* CLAx_SIGS */
#define CLA_SIGS_SIGS1                      BITS(0,3)                        /*!< multiplexer 1 input selection */
#define CLA_SIGS_SIGS1_5                    BIT(14)                          /*!< the fifth bit of multiplexer 1 input selection */
#define CLA_SIGS_SIGS0                      BITS(4,7)                        /*!< multiplexer 0 input selection */
#define CLA_SIGS_SIGS0_5                    BIT(15)                          /*!< the fifth bit of multiplexer 0 input selection */

/* CLAx_LCUCTL */
#define CLA_LCU                            BITS(0,7)                        /*!< LCU control */

