frank0165/McuDspGit20250505/mcu_project__debug_fordsp/src/mcu/GDE501_fireware/Firmware/GD32E501_standard_peripheral/Include/gd32e501_cla.h
/* CLAx_CTL */
#define CLA_CTL_CSEL                       BITS(0,1)                        /*!< clock selection */
#define CLA_CTL_CPOL                       BIT(2)                           /*!< clock polarity*/
#define CLA_CTL_FFRST                      BIT(3)                           /*!< Flip- flop output reset */
#define CLA_CTL_OEN                        BIT(6)                           /*!< output enable */
#define CLA_CTL_OSEL                       BIT(7)                           /*!< output selection */

/* constants definitions */
/* CLA flags */
typedef enum
{
    /* flags in INTF register */
    CLA_FLAG_CLA0NF,                                                        /*!< CLA0 unit negedge flag */
    CLA_FLAG_CLA0PF,                                                        /*!< CLA0 unit posedge flag */
    CLA_FLAG_CLA1NF,                                                        /*!< CLA1 unit negedge flag */
    CLA_FLAG_CLA1PF,                                                        /*!< CLA1 unit posedge flag */
    CLA_FLAG_CLA2NF,                                                        /*!< CLA2 unit negedge flag */
    CLA_FLAG_CLA2PF,                                                        /*!< CLA2 unit posedge flag */
    CLA_FLAG_CLA3NF,                                                        /*!< CLA3 unit negedge flag */
    CLA_FLAG_CLA3PF,                                                        /*!< CLA3 unit posedge flag */
    CLA_FLAG_CLA4NF,                                                        /*!< CLA4 unit negedge flag */
    CLA_FLAG_CLA4PF,                                                        /*!< CLA4 unit posedge flag */
    CLA_FLAG_CLA5NF,                                                        /*!< CLA5 unit negedge flag */
    CLA_FLAG_CLA5PF,                                                        /*!< CLA5 unit posedge flag */
    CLA_FLAG_CLA6NF,                                                        /*!< CLA6 unit negedge flag */
    CLA_FLAG_CLA6PF,                                                        /*!< CLA6 unit posedge flag */
    CLA_FLAG_CLA7NF,                                                        /*!< CLA7 unit negedge flag */
    CLA_FLAG_CLA7PF                                                         /*!< CLA7 unit posedge flag */
}cla_flag_enum;

/* CLA interrupt flags */
typedef enum
{
    /* interrupt flags in INTF register */
    CLA_INT_FLAG_CLA0NF,                                                    /*!< CLA0 unit negedge interrupt flag */
    CLA_INT_FLAG_CLA0PF,                                                    /*!< CLA0 unit posedge interrupt flag */
    CLA_INT_FLAG_CLA1NF,                                                    /*!< CLA1 unit negedge interrupt flag */
    CLA_INT_FLAG_CLA1PF,                                                    /*!< CLA1 unit posedge interrupt flag */
    CLA_INT_FLAG_CLA2NF,                                                    /*!< CLA2 unit negedge interrupt flag */
    CLA_INT_FLAG_CLA2PF,                                                    /*!< CLA2 unit posedge interrupt flag */
    CLA_INT_FLAG_CLA3NF,                                                    /*!< CLA3 unit negedge interrupt flag */
    CLA_INT_FLAG_CLA3PF,                                                    /*!< CLA3 unit posedge interrupt flag */
    CLA_INT_FLAG_CLA4NF,                                                    /*!< CLA4 unit negedge interrupt flag */
    CLA_INT_FLAG_CLA4PF,                                                    /*!< CLA4 unit posedge interrupt flag */
    CLA_INT_FLAG_CLA5NF,                                                    /*!< CLA5 unit negedge interrupt flag */
    CLA_INT_FLAG_CLA5PF,                                                    /*!< CLA5 unit posedge interrupt flag */
    CLA_INT_FLAG_CLA6NF,                                                    /*!< CLA6 unit negedge interrupt flag */
    CLA_INT_FLAG_CLA6PF,                                                    /*!< CLA6 unit posedge interrupt flag */
    CLA_INT_FLAG_CLA7NF,                                                    /*!< CLA7 unit negedge interrupt flag */
    CLA_INT_FLAG_CLA7PF                                                     /*!< CLA7 unit posedge interrupt flag */
}cla_interrupt_flag_enum;

/* CLA units */
typedef enum
{
    CLA0,
    CLA1,
    CLA2,
    CLA3,
    CLA4,
    CLA5,
    CLA6,
    CLA7
}cla_enum;

/* CLA multiplexer */
typedef enum
{
    SIGS0,
    SIGS1
}cla_sigs_enum;

/* output state of CLAx unit */
typedef enum
{
    CLA_OUTPUT_LOW,
    CLA_OUTPUT_HIGH
}cla_outputstatus_enum;

/* negedge interrupt enable */
#define CLA0NIE                          CLA_INTE_CLA0NIE                   /*!< enable CLA0 unit negedge interrupt */
#define CLA1NIE                          CLA_INTE_CLA1NIE                   /*!< enable CLA1 unit negedge interrupt */
#define CLA2NIE                          CLA_INTE_CLA2NIE                   /*!< enable CLA2 unit negedge interrupt */
#define CLA3NIE                          CLA_INTE_CLA3NIE                   /*!< enable CLA3 unit negedge interrupt */
#define CLA4NIE                          CLA_INTE_CLA4NIE                   /*!< enable CLA4 unit negedge interrupt */
#define CLA5NIE                          CLA_INTE_CLA5NIE                   /*!< enable CLA5 unit negedge interrupt */
#define CLA6NIE                          CLA_INTE_CLA6NIE                   /*!< enable CLA6 unit negedge interrupt */
#define CLA7NIE                          CLA_INTE_CLA7NIE                   /*!< enable CLA7 unit negedge interrupt */

/* negedge interrupt disable */
#define CLA0NI_DISABLE                    CLA_INTE_CLA0NIE                   /*!< disable CLA0 unit negedge interrupt */
#define CLA1NI_DISABLE                    CLA_INTE_CLA1NIE                   /*!< disable CLA1 unit negedge interrupt */
#define CLA2NI_DISABLE                    CLA_INTE_CLA2NIE                   /*!< disable CLA2 unit negedge interrupt */
#define CLA3NI_DISABLE                    CLA_INTE_CLA3NIE                   /*!< disable CLA3 unit negedge interrupt */
#define CLA4NI_DISABLE                    CLA_INTE_CLA4NIE                   /*!< disable CLA4 unit negedge interrupt */
#define CLA5NI_DISABLE                    CLA_INTE_CLA5NIE                   /*!< disable CLA5 unit negedge interrupt */
#define CLA6NI_DISABLE                    CLA_INTE_CLA6NIE                   /*!< disable CLA6 unit negedge interrupt */
#define CLA7NI_DISABLE                    CLA_INTE_CLA7NIE                   /*!< disable CLA7 unit negedge interrupt */

