frank0165/McuDspGit20250505/mcu_project__debug_fordsp/src/mcu/GDE501_fireware/Firmware/GD32E501_standard_peripheral/Include/gd32e501_cla.h
/* posedge interrupt enable */
#define CLA0PIE                           CLA_INTE_CLA0PIE                   /*!< enable CLA0 unit  posedge interrupt */
#define CLA1PIE                           CLA_INTE_CLA1PIE                   /*!< enable CLA1 unit  posedge interrupt */
#define CLA2PIE                           CLA_INTE_CLA2PIE                   /*!< enable CLA2 unit  posedge interrupt */
#define CLA3PIE                           CLA_INTE_CLA3PIE                   /*!< enable CLA3 unit  posedge interrupt */
#define CLA4PIE                           CLA_INTE_CLA4PIE                   /*!< enable CLA4 unit  posedge interrupt */
#define CLA5PIE                           CLA_INTE_CLA5PIE                   /*!< enable CLA5 unit  posedge interrupt */
#define CLA6PIE                           CLA_INTE_CLA6PIE                   /*!< enable CLA6 unit  posedge interrupt */
#define CLA7PIE                           CLA_INTE_CLA7PIE                   /*!< enable CLA7 unit  posedge interrupt */

/* posedge interrupt disable */
#define CLA0PI_DISABLE                    CLA_INTE_CLAOPIE                   /*!< disable CLA0 unit  posedge interrupt */
#define CLA1PI_DISABLE                    CLA_INTE_CLA1PIE                   /*!< disable CLA1 unit  posedge interrupt */
#define CLA2PI_DISABLE                    CLA_INTE_CLA2PIE                   /*!< disable CLA2 unit  posedge interrupt */
#define CLA3PI_DISABLE                    CLA_INTE_CLA3PIE                   /*!< disable CLA3 unit  posedge interrupt */
#define CLA4PI_DISABLE                    CLA_INTE_CLA4PIE                   /*!< disable CLA0 unit  posedge interrupt */
#define CLA5PI_DISABLE                    CLA_INTE_CLA5PIE                   /*!< disable CLA1 unit  posedge interrupt */
#define CLA6PI_DISABLE                    CLA_INTE_CLA6PIE                   /*!< disable CLA2 unit  posedge interrupt */
#define CLA7PI_DISABLE                    CLA_INTE_CLA7PIE                   /*!< disable CLA3 unit  posedge interrupt */

/* multiplexer 0 input selection */
#define CLA_SIGS0(regval)                 (BITS(4,7) & ((uint32_t)(regval) << 4))
#define CLA0SIGS0_CLA0_ASYNC_OUT          CLA_SIGS0(0)                        /*!< the input of CLA0SIGS0 is CLA0_ASYNC_OUT */
#define CLA1SIGS0_CLA0_ASYNC_OUT          CLA_SIGS0(0)                        /*!< the input of CLA1SIGS0 is CLA0_ASYNC_OUT */
#define CLA2SIGS0_CLA0_ASYNC_OUT          CLA_SIGS0(0)                        /*!< the input of CLA2SIGS0 is CLA0_ASYNC_OUT */
#define CLA3SIGS0_CLA0_ASYNC_OUT          CLA_SIGS0(0)                        /*!< the input of CLA3SIGS0 is CLA0_ASYNC_OUT */
#define CLA4SIGS0_CLA0_ASYNC_OUT          CLA_SIGS0(0)                        /*!< the input of CLA4SIGS0 is CLA0_ASYNC_OUT */
#define CLA5SIGS0_CLA0_ASYNC_OUT          CLA_SIGS0(0)                        /*!< the input of CLA5SIGS0 is CLA0_ASYNC_OUT */
#define CLA6SIGS0_CLA0_ASYNC_OUT          CLA_SIGS0(0)                        /*!< the input of CLA6SIGS0 is CLA0_ASYNC_OUT */
#define CLA7SIGS0_CLA0_ASYNC_OUT          CLA_SIGS0(0)                        /*!< the input of CLA7SIGS0 is CLA0_ASYNC_OUT */

#define CLA0SIGS0_CLA1_ASYNC_OUT          CLA_SIGS0(1)                        /*!< the input of CLA0SIGS0 is CLA1_ASYNC_OUT */
#define CLA1SIGS0_CLA1_ASYNC_OUT          CLA_SIGS0(1)                        /*!< the input of CLA1SIGS0 is CLA1_ASYNC_OUT */
#define CLA2SIGS0_CLA1_ASYNC_OUT          CLA_SIGS0(1)                        /*!< the input of CLA2SIGS0 is CLA1_ASYNC_OUT */
#define CLA3SIGS0_CLA1_ASYNC_OUT          CLA_SIGS0(1)                        /*!< the input of CLA3SIGS0 is CLA1_ASYNC_OUT */
#define CLA4SIGS0_CLA1_ASYNC_OUT          CLA_SIGS0(1)                        /*!< the input of CLA4SIGS0 is CLA1_ASYNC_OUT */
#define CLA5SIGS0_CLA1_ASYNC_OUT          CLA_SIGS0(1)                        /*!< the input of CLA5SIGS0 is CLA1_ASYNC_OUT */
#define CLA6SIGS0_CLA1_ASYNC_OUT          CLA_SIGS0(1)                        /*!< the input of CLA6SIGS0 is CLA1_ASYNC_OUT */
#define CLA7SIGS0_CLA1_ASYNC_OUT          CLA_SIGS0(1)                        /*!< the input of CLA7SIGS0 is CLA1_ASYNC_OUT */

#define CLA0SIGS0_CLA2_ASYNC_OUT          CLA_SIGS0(2)                        /*!< the input of CLA0SIGS0 is CLA2_ASYNC_OUT */
#define CLA1SIGS0_CLA2_ASYNC_OUT          CLA_SIGS0(2)                        /*!< the input of CLA1SIGS0 is CLA2_ASYNC_OUT */
#define CLA2SIGS0_CLA2_ASYNC_OUT          CLA_SIGS0(2)                        /*!< the input of CLA2SIGS0 is CLA2_ASYNC_OUT */
#define CLA3SIGS0_CLA2_ASYNC_OUT          CLA_SIGS0(2)                        /*!< the input of CLA3SIGS0 is CLA2_ASYNC_OUT */
#define CLA4SIGS0_CLA2_ASYNC_OUT          CLA_SIGS0(2)                        /*!< the input of CLA4SIGS0 is CLA2_ASYNC_OUT */
#define CLA5SIGS0_CLA2_ASYNC_OUT          CLA_SIGS0(2)                        /*!< the input of CLA5SIGS0 is CLA2_ASYNC_OUT */
#define CLA6SIGS0_CLA2_ASYNC_OUT          CLA_SIGS0(2)                        /*!< the input of CLA6SIGS0 is CLA2_ASYNC_OUT */
#define CLA7SIGS0_CLA2_ASYNC_OUT          CLA_SIGS0(2)                        /*!< the input of CLA7SIGS0 is CLA2_ASYNC_OUT */

#define CLA0SIGS0_CLA3_ASYNC_OUT          CLA_SIGS0(3)                        /*!< the input of CLA0SIGS0 is CLA3_ASYNC_OUT */
#define CLA1SIGS0_CLA3_ASYNC_OUT          CLA_SIGS0(3)                        /*!< the input of CLA1SIGS0 is CLA3_ASYNC_OUT */
#define CLA2SIGS0_CLA3_ASYNC_OUT          CLA_SIGS0(3)                        /*!< the input of CLA2SIGS0 is CLA3_ASYNC_OUT */
#define CLA3SIGS0_CLA3_ASYNC_OUT          CLA_SIGS0(3)                        /*!< the input of CLA3SIGS0 is CLA3_ASYNC_OUT */
#define CLA4SIGS0_CLA3_ASYNC_OUT          CLA_SIGS0(3)                        /*!< the input of CLA4SIGS0 is CLA3_ASYNC_OUT */
#define CLA5SIGS0_CLA3_ASYNC_OUT          CLA_SIGS0(3)                        /*!< the input of CLA5SIGS0 is CLA3_ASYNC_OUT */
#define CLA6SIGS0_CLA3_ASYNC_OUT          CLA_SIGS0(3)                        /*!< the input of CLA6SIGS0 is CLA3_ASYNC_OUT */
#define CLA7SIGS0_CLA3_ASYNC_OUT          CLA_SIGS0(3)                        /*!< the input of CLA7SIGS0 is CLA3_ASYNC_OUT */

#define CLA0SIGS0_TIMER1_TRGO             CLA_SIGS0(4)                        /*!< the input of CLA0SIGS0 is TIMER1_TRGO */
#define CLA1SIGS0_TIMER2_TRGO             CLA_SIGS0(4)                        /*!< the input of CLA1SIGS0 is TIMER2_TRGO */
#define CLA2SIGS0_TIMER5_TRGO             CLA_SIGS0(4)                        /*!< the input of CLA2SIGS0 is TIMER5_TRGO */
#define CLA3SIGS0_TIMER6_TRGO             CLA_SIGS0(4)                        /*!< the input of CLA3SIGS0 is TIMER6_TRGO */
#define CLA4SIGS0_TIMER1_TRGO             CLA_SIGS0(4)                        /*!< the input of CLA4SIGS0 is TIMER1_TRGO */
#define CLA5SIGS0_TIMER2_TRGO             CLA_SIGS0(4)                        /*!< the input of CLA5SIGS0 is TIMER2_TRGO */
#define CLA6SIGS0_TIMER5_TRGO             CLA_SIGS0(4)                        /*!< the input of CLA6SIGS0 is TIMER5_TRGO */
#define CLA7SIGS0_TIMER6_TRGO             CLA_SIGS0(4)                        /*!< the input of CLA7SIGS0 is TIMER6_TRGO */

