frank0165/McuDspGit20250505/mcu_project__debug_fordsp/src/mcu/GDE501_fireware/Firmware/GD32E501_standard_peripheral/Include/gd32e501_cla.h
#define CLA0SIGS0_TIMER0_CH0              CLA_SIGS0(5)                        /*!< the input of CLA0SIGS0 is TIMER0_CH0 */
#define CLA1SIGS0_TIMER0_CH0              CLA_SIGS0(5)                        /*!< the input of CLA1SIGS0 is TIMER0_CH0 */
#define CLA2SIGS0_TIMER0_CH1              CLA_SIGS0(5)                        /*!< the input of CLA2SIGS0 is TIMER0_CH1 */
#define CLA3SIGS0_TIMER0_CH2              CLA_SIGS0(5)                        /*!< the input of CLA3SIGS0 is TIMER0_CH2 */
#define CLA4SIGS0_TIMER0_CH0              CLA_SIGS0(5)                        /*!< the input of CLA4SIGS0 is TIMER0_CH0 */
#define CLA5SIGS0_TIMER0_CH0              CLA_SIGS0(5)                        /*!< the input of CLA5SIGS0 is TIMER0_CH0 */
#define CLA6SIGS0_TIMER0_CH1              CLA_SIGS0(5)                        /*!< the input of CLA6SIGS0 is TIMER0_CH1 */
#define CLA7SIGS0_TIMER0_CH2              CLA_SIGS0(5)                        /*!< the input of CLA7SIGS0 is TIMER0_CH2 */

#define CLA0SIGS0_TIMER0_CH1              CLA_SIGS0(6)                        /*!< the input of CLA0SIGS0 is TIMER0_CH1 */
#define CLA1SIGS0_TIMER0_CH3              CLA_SIGS0(6)                        /*!< the input of CLA1SIGS0 is TIMER0_CH3 */
#define CLA2SIGS0_TIMER0_CH3              CLA_SIGS0(6)                        /*!< the input of CLA2SIGS0 is TIMER0_CH3 */
#define CLA3SIGS0_TIMER1_CH0              CLA_SIGS0(6)                        /*!< the input of CLA3SIGS0 is TIMER1_CH0 */
#define CLA4SIGS0_TIMER0_CH1              CLA_SIGS0(6)                        /*!< the input of CLA4SIGS0 is TIMER0_CH1 */
#define CLA5SIGS0_TIMER0_CH3              CLA_SIGS0(6)                        /*!< the input of CLA5SIGS0 is TIMER0_CH3 */
#define CLA6SIGS0_TIMER0_CH3              CLA_SIGS0(6)                        /*!< the input of CLA6SIGS0 is TIMER0_CH3 */
#define CLA7SIGS0_TIMER1_CH0              CLA_SIGS0(6)                        /*!< the input of CLA7SIGS0 is TIMER1_CH0 */

#define CLA0SIGS0_TIMER0_CH2              CLA_SIGS0(7)                        /*!< the input of CLA0SIGS0 is TIMER0_CH2 */
#define CLA1SIGS0_TIMER1_CH0              CLA_SIGS0(7)                        /*!< the input of CLA1SIGS0 is TIMER1_CH0 */
#define CLA2SIGS0_TIMER1_CH1              CLA_SIGS0(7)                        /*!< the input of CLA2SIGS0 is TIMER1_CH1 */
#define CLA3SIGS0_TIMER1_CH1              CLA_SIGS0(7)                        /*!< the input of CLA3SIGS0 is TIMER1_CH1 */
#define CLA4SIGS0_TIMER0_CH2              CLA_SIGS0(7)                        /*!< the input of CLA4SIGS0 is TIMER0_CH2 */
#define CLA5SIGS0_TIMER1_CH0              CLA_SIGS0(7)                        /*!< the input of CLA5SIGS0 is TIMER1_CH0 */
#define CLA6SIGS0_TIMER1_CH1              CLA_SIGS0(7)                        /*!< the input of CLA6SIGS0 is TIMER1_CH1 */
#define CLA7SIGS0_TIMER1_CH1              CLA_SIGS0(7)                        /*!< the input of CLA7SIGS0 is TIMER1_CH1 */

#define CLA0SIGS0_CLAIN0                  CLA_SIGS0(8)                        /*!< the input of CLA0SIGS0 is CLAIN0(PA15) */
#define CLA1SIGS0_CLAIN4                  CLA_SIGS0(8)                        /*!< the input of CLA1SIGS0 is CLAIN4(PB6) */
#define CLA2SIGS0_CLAIN0                  CLA_SIGS0(8)                        /*!< the input of CLA2SIGS0 is CLAIN0(PA15) */
#define CLA3SIGS0_CLAIN2                  CLA_SIGS0(8)                        /*!< the input of CLA3SIGS0 is CLAIN2(PB4) */
#define CLA4SIGS0_CLAIN0                  CLA_SIGS0(8)                        /*!< the input of CLA4SIGS0 is CLAIN0(PA15) */
#define CLA5SIGS0_CLAIN4                  CLA_SIGS0(8)                        /*!< the input of CLA5SIGS0 is CLAIN4(PB6) */
#define CLA6SIGS0_CLAIN0                  CLA_SIGS0(8)                        /*!< the input of CLA6SIGS0 is CLAIN0(PA15) */
#define CLA7SIGS0_CLAIN2                  CLA_SIGS0(8)                        /*!< the input of CLA7SIGS0 is CLAIN2(PB4) */

#define CLA0SIGS0_CLAIN2                  CLA_SIGS0(9)                        /*!< the input of CLA0SIGS0 is CLAIN2(PB4) */
#define CLA1SIGS0_CLAIN5                  CLA_SIGS0(9)                        /*!< the input of CLA1SIGS0 is CLAIN5(PB7) */
#define CLA2SIGS0_CLAIN1                  CLA_SIGS0(9)                        /*!< the input of CLA2SIGS0 is CLAIN1(PB3) */
#define CLA3SIGS0_CLAIN3                  CLA_SIGS0(9)                        /*!< the input of CLA3SIGS0 is CLAIN3(PB5) */
#define CLA4SIGS0_CLAIN2                  CLA_SIGS0(9)                        /*!< the input of CLA4SIGS0 is CLAIN2(PB4) */
#define CLA5SIGS0_CLAIN5                  CLA_SIGS0(9)                        /*!< the input of CLA5SIGS0 is CLAIN5(PB7) */
#define CLA6SIGS0_CLAIN1                  CLA_SIGS0(9)                        /*!< the input of CLA6SIGS0 is CLAIN1(PB3) */
#define CLA7SIGS0_CLAIN3                  CLA_SIGS0(9)                        /*!< the input of CLA7SIGS0 is CLAIN3(PB5) */

#define CLA0SIGS0_CLAIN4                  CLA_SIGS0(10)                       /*!< the input of CLA0SIGS0 is CLAIN4(PB6) */
#define CLA1SIGS0_CLAIN8                  CLA_SIGS0(10)                       /*!< the input of CLA1SIGS0 is CLAIN8(PB0) */
#define CLA2SIGS0_CLAIN8                  CLA_SIGS0(10)                       /*!< the input of CLA2SIGS0 is CLAIN8(PB0) */
#define CLA3SIGS0_CLAIN6                  CLA_SIGS0(10)                       /*!< the input of CLA3SIGS0 is CLAIN6(PB8) */
#define CLA4SIGS0_CLAIN4                  CLA_SIGS0(10)                       /*!< the input of CLA4SIGS0 is CLAIN4(PB6) */
#define CLA5SIGS0_CLAIN8                  CLA_SIGS0(10)                       /*!< the input of CLA5SIGS0 is CLAIN8(PB0) */
#define CLA6SIGS0_CLAIN8                  CLA_SIGS0(10)                       /*!< the input of CLA6SIGS0 is CLAIN8(PB0) */
#define CLA7SIGS0_CLAIN6                  CLA_SIGS0(10)                       /*!< the input of CLA7SIGS0 is CLAIN6(PB8) */

#define CLA0SIGS0_CLAIN6                  CLA_SIGS0(11)                       /*!< the input of CLA0SIGS0 is CLAIN6(PB8) */
#define CLA1SIGS0_CLAIN10                 CLA_SIGS0(11)                       /*!< the input of CLA1SIGS0 is CLAIN10(PB2) */
#define CLA2SIGS0_CLAIN9                  CLA_SIGS0(11)                       /*!< the input of CLA2SIGS0 is CLAIN9(PB1) */
#define CLA3SIGS0_CLAIN7                  CLA_SIGS0(11)                       /*!< the input of CLA3SIGS0 is CLAIN7(PB9) */
#define CLA4SIGS0_CLAIN6                  CLA_SIGS0(11)                       /*!< the input of CLA4SIGS0 is CLAIN6(PB8) */
#define CLA5SIGS0_CLAIN10                 CLA_SIGS0(11)                       /*!< the input of CLA5SIGS0 is CLAIN10(PB2) */
#define CLA6SIGS0_CLAIN9                  CLA_SIGS0(11)                       /*!< the input of CLA6SIGS0 is CLAIN9(PB1) */
#define CLA7SIGS0_CLAIN7                  CLA_SIGS0(11)                       /*!< the input of CLA7SIGS0 is CLAIN7(PB9) */

#define CLA0SIGS0_CLAIN8                  CLA_SIGS0(12)                       /*!< the input of CLA0SIGS0 is CLAIN8(PB0) */
#define CLA1SIGS0_CLAIN12                 CLA_SIGS0(12)                       /*!< the input of CLA1SIGS0 is CLAIN12(PA9) */
#define CLA2SIGS0_CLAIN14                 CLA_SIGS0(12)                       /*!< the input of CLA2SIGS0 is CLAIN14(PA11) */
#define CLA3SIGS0_CLAIN10                 CLA_SIGS0(12)                       /*!< the input of CLA3SIGS0 is CLAIN10(PB2) */
#define CLA4SIGS0_CLAIN8                  CLA_SIGS0(12)                       /*!< the input of CLA4SIGS0 is CLAIN8(PB0) */
#define CLA5SIGS0_CLAIN12                 CLA_SIGS0(12)                       /*!< the input of CLA5SIGS0 is CLAIN12(PA9) */
#define CLA6SIGS0_CLAIN14                 CLA_SIGS0(12)                       /*!< the input of CLA6SIGS0 is CLAIN14(PA11) */
#define CLA7SIGS0_CLAIN10                 CLA_SIGS0(12)                       /*!< the input of CLA7SIGS0 is CLAIN10(PB2) */

#define CLA0SIGS0_CLAIN10                 CLA_SIGS0(13)                       /*!< the input of CLA0SIGS0 is CLAIN10(PB2) */
#define CLA1SIGS0_CLAIN13                 CLA_SIGS0(13)                       /*!< the input of CLA1SIGS0 is CLAIN13(PA10) */
#define CLA2SIGS0_CLAIN15                 CLA_SIGS0(13)                       /*!< the input of CLA2SIGS0 is CLAIN15(PA12) */
#define CLA3SIGS0_CLAIN11                 CLA_SIGS0(13)                       /*!< the input of CLA3SIGS0 is CLAIN11(PA8) */
#define CLA4SIGS0_CLAIN10                 CLA_SIGS0(13)                       /*!< the input of CLA4SIGS0 is CLAIN10(PB2) */
#define CLA5SIGS0_CLAIN13                 CLA_SIGS0(13)                       /*!< the input of CLA5SIGS0 is CLAIN13(PA10) */
#define CLA6SIGS0_CLAIN15                 CLA_SIGS0(13)                       /*!< the input of CLA6SIGS0 is CLAIN15(PA12) */
#define CLA7SIGS0_CLAIN11                 CLA_SIGS0(13)                       /*!< the input of CLA7SIGS0 is CLAIN11(PA8) */

#define CLA0SIGS0_CLAIN12                 CLA_SIGS0(14)                       /*!< the input of CLA0SIGS0 is CLAIN12(PA9) */
#define CLA1SIGS0_CLAIN16                 CLA_SIGS0(14)                       /*!< the input of CLA1SIGS0 is CLAIN16(PF0) */
#define CLA2SIGS0_CLAIN16                 CLA_SIGS0(14)                       /*!< the input of CLA2SIGS0 is CLAIN16(PF0) */
#define CLA3SIGS0_CLAIN18                 CLA_SIGS0(14)                       /*!< the input of CLA3SIGS0 is CLAIN18(PA0) */
#define CLA4SIGS0_CLAIN12                 CLA_SIGS0(14)                       /*!< the input of CLA4SIGS0 is CLAIN12(PA9) */
#define CLA5SIGS0_CLAIN16                 CLA_SIGS0(14)                       /*!< the input of CLA5SIGS0 is CLAIN16(PF0) */
#define CLA6SIGS0_CLAIN16                 CLA_SIGS0(14)                       /*!< the input of CLA6SIGS0 is CLAIN16(PF0) */
#define CLA7SIGS0_CLAIN18                 CLA_SIGS0(14)                       /*!< the input of CLA7SIGS0 is CLAIN18(PA0) */

#define CLA0SIGS0_CLAIN14                 CLA_SIGS0(15)                       /*!< the input of CLA0SIGS0 is CLAIN14(PA11) */
#define CLA1SIGS0_CLAIN18                 CLA_SIGS0(15)                       /*!< the input of CLA1SIGS0 is CLAIN18(PA0) */
#define CLA2SIGS0_CLAIN17                 CLA_SIGS0(15)                       /*!< the input of CLA2SIGS0 is CLAIN17(PF1) */
#define CLA3SIGS0_CLAIN19                 CLA_SIGS0(15)                       /*!< the input of CLA3SIGS0 is CLAIN19(PA1) */
#define CLA4SIGS0_CLAIN14                 CLA_SIGS0(15)                       /*!< the input of CLA4SIGS0 is CLAIN14(PA11) */
#define CLA5SIGS0_CLAIN18                 CLA_SIGS0(15)                       /*!< the input of CLA5SIGS0 is CLAIN18(PA0) */
#define CLA6SIGS0_CLAIN17                 CLA_SIGS0(15)                       /*!< the input of CLA6SIGS0 is CLAIN17(PF1) */
#define CLA7SIGS0_CLAIN19                 CLA_SIGS0(15)                       /*!< the input of CLA7SIGS0 is CLAIN19(PA1) */

