frank0165/McuDspGit20250505/mcu_project__debug_fordsp/src/mcu/GDE501_fireware/Firmware/GD32E501_standard_peripheral/Include/gd32e501_cla.h
#define CLA0SIGS0_CLA4_ASYNC_OUT          CLA_SIGS_SIGS0_5|CLA_SIGS0(0)        /*!< the input of CLA0SIGS0 is CLA4_ASYNC_OUT */
#define CLA1SIGS0_CLA4_ASYNC_OUT          CLA_SIGS_SIGS0_5|CLA_SIGS0(0)        /*!< the input of CLA1SIGS0 is CLA4_ASYNC_OUT */
#define CLA2SIGS0_CLA4_ASYNC_OUT          CLA_SIGS_SIGS0_5|CLA_SIGS0(0)        /*!< the input of CLA2SIGS0 is CLA4_ASYNC_OUT */
#define CLA3SIGS0_CLA4_ASYNC_OUT          CLA_SIGS_SIGS0_5|CLA_SIGS0(0)        /*!< the input of CLA3SIGS0 is CLA4_ASYNC_OUT */
#define CLA4SIGS0_CLA4_ASYNC_OUT          CLA_SIGS_SIGS0_5|CLA_SIGS0(0)        /*!< the input of CLA4SIGS0 is CLA4_ASYNC_OUT */
#define CLA5SIGS0_CLA4_ASYNC_OUT          CLA_SIGS_SIGS0_5|CLA_SIGS0(0)        /*!< the input of CLA5SIGS0 is CLA4_ASYNC_OUT */
#define CLA6SIGS0_CLA4_ASYNC_OUT          CLA_SIGS_SIGS0_5|CLA_SIGS0(0)        /*!< the input of CLA6SIGS0 is CLA4_ASYNC_OUT */
#define CLA7SIGS0_CLA4_ASYNC_OUT          CLA_SIGS_SIGS0_5|CLA_SIGS0(0)        /*!< the input of CLA7SIGS0 is CLA4_ASYNC_OUT */

#define CLA0SIGS0_CLA5_ASYNC_OUT          CLA_SIGS_SIGS0_5|CLA_SIGS0(1)        /*!< the input of CLA0SIGS0 is CLA5_ASYNC_OUT */
#define CLA1SIGS0_CLA5_ASYNC_OUT          CLA_SIGS_SIGS0_5|CLA_SIGS0(1)        /*!< the input of CLA1SIGS0 is CLA5_ASYNC_OUT */
#define CLA2SIGS0_CLA5_ASYNC_OUT          CLA_SIGS_SIGS0_5|CLA_SIGS0(1)        /*!< the input of CLA2SIGS0 is CLA5_ASYNC_OUT */
#define CLA3SIGS0_CLA5_ASYNC_OUT          CLA_SIGS_SIGS0_5|CLA_SIGS0(1)        /*!< the input of CLA3SIGS0 is CLA5_ASYNC_OUT */
#define CLA4SIGS0_CLA5_ASYNC_OUT          CLA_SIGS_SIGS0_5|CLA_SIGS0(1)        /*!< the input of CLA4SIGS0 is CLA5_ASYNC_OUT */
#define CLA5SIGS0_CLA5_ASYNC_OUT          CLA_SIGS_SIGS0_5|CLA_SIGS0(1)        /*!< the input of CLA5SIGS0 is CLA5_ASYNC_OUT */
#define CLA6SIGS0_CLA5_ASYNC_OUT          CLA_SIGS_SIGS0_5|CLA_SIGS0(1)        /*!< the input of CLA6SIGS0 is CLA5_ASYNC_OUT */
#define CLA7SIGS0_CLA5_ASYNC_OUT          CLA_SIGS_SIGS0_5|CLA_SIGS0(1)        /*!< the input of CLA7SIGS0 is CLA5_ASYNC_OUT */

#define CLA1SIGS0_CLA6_ASYNC_OUT          CLA_SIGS_SIGS0_5|CLA_SIGS0(2)        /*!< the input of CLA1SIGS0 is CLA6_ASYNC_OUT */
#define CLA2SIGS0_CLA6_ASYNC_OUT          CLA_SIGS_SIGS0_5|CLA_SIGS0(2)        /*!< the input of CLA2SIGS0 is CLA6_ASYNC_OUT */
#define CLA3SIGS0_CLA6_ASYNC_OUT          CLA_SIGS_SIGS0_5|CLA_SIGS0(2)        /*!< the input of CLA3SIGS0 is CLA6_ASYNC_OUT */
#define CLA4SIGS0_CLA6_ASYNC_OUT          CLA_SIGS_SIGS0_5|CLA_SIGS0(2)        /*!< the input of CLA4SIGS0 is CLA6_ASYNC_OUT */
#define CLA5SIGS0_CLA6_ASYNC_OUT          CLA_SIGS_SIGS0_5|CLA_SIGS0(2)        /*!< the input of CLA5SIGS0 is CLA6_ASYNC_OUT */
#define CLA6SIGS0_CLA6_ASYNC_OUT          CLA_SIGS_SIGS0_5|CLA_SIGS0(2)        /*!< the input of CLA6SIGS0 is CLA6_ASYNC_OUT */
#define CLA7SIGS0_CLA6_ASYNC_OUT          CLA_SIGS_SIGS0_5|CLA_SIGS0(2)        /*!< the input of CLA7SIGS0 is CLA6_ASYNC_OUT */

#define CLA0SIGS0_CLA7_ASYNC_OUT          CLA_SIGS_SIGS0_5|CLA_SIGS0(3)        /*!< the input of CLA0SIGS0 is CLA7_ASYNC_OUT */
#define CLA1SIGS0_CLA7_ASYNC_OUT          CLA_SIGS_SIGS0_5|CLA_SIGS0(3)        /*!< the input of CLA1SIGS0 is CLA7_ASYNC_OUT */
#define CLA2SIGS0_CLA7_ASYNC_OUT          CLA_SIGS_SIGS0_5|CLA_SIGS0(3)        /*!< the input of CLA2SIGS0 is CLA7_ASYNC_OUT */
#define CLA3SIGS0_CLA7_ASYNC_OUT          CLA_SIGS_SIGS0_5|CLA_SIGS0(3)        /*!< the input of CLA3SIGS0 is CLA7_ASYNC_OUT */
#define CLA4SIGS0_CLA7_ASYNC_OUT          CLA_SIGS_SIGS0_5|CLA_SIGS0(3)        /*!< the input of CLA4SIGS0 is CLA7_ASYNC_OUT */
#define CLA5SIGS0_CLA7_ASYNC_OUT          CLA_SIGS_SIGS0_5|CLA_SIGS0(3)        /*!< the input of CLA5SIGS0 is CLA7_ASYNC_OUT */
#define CLA6SIGS0_CLA7_ASYNC_OUT          CLA_SIGS_SIGS0_5|CLA_SIGS0(3)        /*!< the input of CLA6SIGS0 is CLA7_ASYNC_OUT */
#define CLA7SIGS0_CLA7_ASYNC_OUT          CLA_SIGS_SIGS0_5|CLA_SIGS0(3)        /*!< the input of CLA7SIGS0 is CLA7_ASYNC_OUT */

/* multiplexer 1 input selection */
#define CLA_SIGS1(regval)                 (BITS(0,3) & ((uint32_t)(regval) << 0))
#define CLA0SIGS1_CLA0_ASYNC_OUT          CLA_SIGS1(0)                        /*!< the input of CLA0SIGS1 is CLA0_ASYNC_OUT */
#define CLA1SIGS1_CLA0_ASYNC_OUT          CLA_SIGS1(0)                        /*!< the input of CLA1SIGS1 is CLA0_ASYNC_OUT */
#define CLA2SIGS1_CLA0_ASYNC_OUT          CLA_SIGS1(0)                        /*!< the input of CLA2SIGS1 is CLA0_ASYNC_OUT */
#define CLA3SIGS1_CLA0_ASYNC_OUT          CLA_SIGS1(0)                        /*!< the input of CLA3SIGS1 is CLA0_ASYNC_OUT */
#define CLA4SIGS1_CLA0_ASYNC_OUT          CLA_SIGS1(0)                        /*!< the input of CLA4SIGS1 is CLA0_ASYNC_OUT */
#define CLA5SIGS1_CLA0_ASYNC_OUT          CLA_SIGS1(0)                        /*!< the input of CLA5SIGS1 is CLA0_ASYNC_OUT */
#define CLA6SIGS1_CLA0_ASYNC_OUT          CLA_SIGS1(0)                        /*!< the input of CLA6SIGS1 is CLA0_ASYNC_OUT */
#define CLA7SIGS1_CLA0_ASYNC_OUT          CLA_SIGS1(0)                        /*!< the input of CLA7SIGS1 is CLA0_ASYNC_OUT */

#define CLA0SIGS1_CLA1_ASYNC_OUT          CLA_SIGS1(1)                        /*!< the input of CLA0SIGS1 is CLA1_ASYNC_OUT */
#define CLA1SIGS1_CLA1_ASYNC_OUT          CLA_SIGS1(1)                        /*!< the input of CLA1SIGS1 is CLA1_ASYNC_OUT */
#define CLA2SIGS1_CLA1_ASYNC_OUT          CLA_SIGS1(1)                        /*!< the input of CLA2SIGS1 is CLA1_ASYNC_OUT */
#define CLA3SIGS1_CLA1_ASYNC_OUT          CLA_SIGS1(1)                        /*!< the input of CLA3SIGS1 is CLA1_ASYNC_OUT */
#define CLA4SIGS1_CLA1_ASYNC_OUT          CLA_SIGS1(1)                        /*!< the input of CLA4SIGS1 is CLA1_ASYNC_OUT */
#define CLA5SIGS1_CLA1_ASYNC_OUT          CLA_SIGS1(1)                        /*!< the input of CLA5SIGS1 is CLA1_ASYNC_OUT */
#define CLA6SIGS1_CLA1_ASYNC_OUT          CLA_SIGS1(1)                        /*!< the input of CLA6SIGS1 is CLA1_ASYNC_OUT */
#define CLA7SIGS1_CLA1_ASYNC_OUT          CLA_SIGS1(1)                        /*!< the input of CLA7SIGS1 is CLA1_ASYNC_OUT */

#define CLA0SIGS1_CLA2_ASYNC_OUT          CLA_SIGS1(2)                        /*!< the input of CLA0SIGS1 is CLA2_ASYNC_OUT */
#define CLA1SIGS1_CLA2_ASYNC_OUT          CLA_SIGS1(2)                        /*!< the input of CLA1SIGS1 is CLA2_ASYNC_OUT */
#define CLA2SIGS1_CLA2_ASYNC_OUT          CLA_SIGS1(2)                        /*!< the input of CLA2SIGS1 is CLA2_ASYNC_OUT */
#define CLA3SIGS1_CLA2_ASYNC_OUT          CLA_SIGS1(2)                        /*!< the input of CLA3SIGS1 is CLA2_ASYNC_OUT */
#define CLA4SIGS1_CLA2_ASYNC_OUT          CLA_SIGS1(2)                        /*!< the input of CLA4SIGS1 is CLA2_ASYNC_OUT */
#define CLA5SIGS1_CLA2_ASYNC_OUT          CLA_SIGS1(2)                        /*!< the input of CLA5SIGS1 is CLA2_ASYNC_OUT */
#define CLA6SIGS1_CLA2_ASYNC_OUT          CLA_SIGS1(2)                        /*!< the input of CLA6SIGS1 is CLA2_ASYNC_OUT */
#define CLA7SIGS1_CLA2_ASYNC_OUT          CLA_SIGS1(2)                        /*!< the input of CLA7SIGS1 is CLA2_ASYNC_OUT */

#define CLA0SIGS1_CLA3_ASYNC_OUT          CLA_SIGS1(3)                        /*!< the input of CLA0SIGS1 is CLA3_ASYNC_OUT */
#define CLA1SIGS1_CLA3_ASYNC_OUT          CLA_SIGS1(3)                        /*!< the input of CLA1SIGS1 is CLA3_ASYNC_OUT */
#define CLA2SIGS1_CLA3_ASYNC_OUT          CLA_SIGS1(3)                        /*!< the input of CLA2SIGS1 is CLA3_ASYNC_OUT */
#define CLA3SIGS1_CLA3_ASYNC_OUT          CLA_SIGS1(3)                        /*!< the input of CLA3SIGS1 is CLA3_ASYNC_OUT */
#define CLA4SIGS1_CLA3_ASYNC_OUT          CLA_SIGS1(3)                        /*!< the input of CLA4SIGS1 is CLA3_ASYNC_OUT */
#define CLA5SIGS1_CLA3_ASYNC_OUT          CLA_SIGS1(3)                        /*!< the input of CLA5SIGS1 is CLA3_ASYNC_OUT */
#define CLA6SIGS1_CLA3_ASYNC_OUT          CLA_SIGS1(3)                        /*!< the input of CLA6SIGS1 is CLA3_ASYNC_OUT */
#define CLA7SIGS1_CLA3_ASYNC_OUT          CLA_SIGS1(3)                        /*!< the input of CLA7SIGS1 is CLA3_ASYNC_OUT */

#define CLA0SIGS1_ADC_CONV                CLA_SIGS1(4)                        /*!< the input of CLA0SIGS1 is ADC_CONV */
#define CLA1SIGS1_ADC_CONV                CLA_SIGS1(4)                        /*!< the input of CLA1SIGS1 is ADC_CONV */
#define CLA2SIGS1_ADC_CONV                CLA_SIGS1(4)                        /*!< the input of CLA2SIGS1 is ADC_CONV */
#define CLA3SIGS1_ADC_CONV                CLA_SIGS1(4)                        /*!< the input of CLA3SIGS1 is ADC_CONV */
#define CLA4SIGS1_ADC_CONV                CLA_SIGS1(4)                        /*!< the input of CLA4SIGS1 is ADC_CONV */
#define CLA5SIGS1_ADC_CONV                CLA_SIGS1(4)                        /*!< the input of CLA5SIGS1 is ADC_CONV */
#define CLA6SIGS1_ADC_CONV                CLA_SIGS1(4)                        /*!< the input of CLA6SIGS1 is ADC_CONV */
#define CLA7SIGS1_ADC_CONV                CLA_SIGS1(4)                        /*!< the input of CLA7SIGS1 is ADC_CONV */

