frank0165/McuDspGit20250505/mcu_project__debug_fordsp/src/mcu/GDE501_fireware/Firmware/GD32E501_standard_peripheral/Include/gd32e501_cla.h
#define CLA0SIGS1_TIMER0_CH3              CLA_SIGS1(5)                        /*!< the input of CLA0SIGS1 is TIMER0_CH3 */
#define CLA1SIGS1_TIMER0_CH1              CLA_SIGS1(5)                        /*!< the input of CLA1SIGS1 is TIMER0_CH1 */
#define CLA2SIGS1_TIMER0_CH0              CLA_SIGS1(5)                        /*!< the input of CLA2SIGS1 is TIMER0_CH0 */
#define CLA3SIGS1_TIMER0_CH0              CLA_SIGS1(5)                        /*!< the input of CLA3SIGS1 is TIMER0_CH0 */
#define CLA4SIGS1_TIMER0_CH3              CLA_SIGS1(5)                        /*!< the input of CLA4SIGS1 is TIMER0_CH3 */
#define CLA5SIGS1_TIMER0_CH1              CLA_SIGS1(5)                        /*!< the input of CLA5SIGS1 is TIMER0_CH1 */
#define CLA6SIGS1_TIMER0_CH0              CLA_SIGS1(5)                        /*!< the input of CLA6SIGS1 is TIMER0_CH0 */
#define CLA7SIGS1_TIMER0_CH0              CLA_SIGS1(5)                        /*!< the input of CLA7SIGS1 is TIMER0_CH0 */

#define CLA0SIGS1_TIMER1_CH0              CLA_SIGS1(6)                        /*!< the input of CLA0SIGS1 is TIMER1_CH0 */
#define CLA1SIGS1_TIMER0_CH2              CLA_SIGS1(6)                        /*!< the input of CLA1SIGS1 is TIMER0_CH2 */
#define CLA2SIGS1_TIMER0_CH2              CLA_SIGS1(6)                        /*!< the input of CLA2SIGS1 is TIMER0_CH2 */
#define CLA3SIGS1_TIMER0_CH1              CLA_SIGS1(6)                        /*!< the input of CLA3SIGS1 is TIMER0_CH1 */
#define CLA4SIGS1_TIMER1_CH0              CLA_SIGS1(6)                        /*!< the input of CLA4SIGS1 is TIMER1_CH0 */
#define CLA5SIGS1_TIMER0_CH2              CLA_SIGS1(6)                        /*!< the input of CLA5SIGS1 is TIMER0_CH2 */
#define CLA6SIGS1_TIMER0_CH2              CLA_SIGS1(6)                        /*!< the input of CLA6SIGS1 is TIMER0_CH2 */
#define CLA7SIGS1_TIMER0_CH1              CLA_SIGS1(6)                        /*!< the input of CLA7SIGS1 is TIMER0_CH1 */

#define CLA0SIGS1_TIMER1_CH1              CLA_SIGS1(7)                        /*!< the input of CLA0SIGS1 is TIMER1_CH1 */
#define CLA1SIGS1_TIMER1_CH1              CLA_SIGS1(7)                        /*!< the input of CLA1SIGS1 is TIMER1_CH1 */
#define CLA2SIGS1_TIMER1_CH0              CLA_SIGS1(7)                        /*!< the input of CLA2SIGS1 is TIMER1_CH0 */
#define CLA3SIGS1_TIMER0_CH3              CLA_SIGS1(7)                        /*!< the input of CLA3SIGS1 is TIMER0_CH3 */
#define CLA4SIGS1_TIMER1_CH1              CLA_SIGS1(7)                        /*!< the input of CLA4SIGS1 is TIMER1_CH1 */
#define CLA5SIGS1_TIMER1_CH1              CLA_SIGS1(7)                        /*!< the input of CLA5SIGS1 is TIMER1_CH1 */
#define CLA6SIGS1_TIMER1_CH0              CLA_SIGS1(7)                        /*!< the input of CLA6SIGS1 is TIMER1_CH0 */
#define CLA7SIGS1_TIMER0_CH3              CLA_SIGS1(7)                        /*!< the input of CLA7SIGS1 is TIMER0_CH3 */

#define CLA0SIGS1_CLAIN1                  CLA_SIGS1(8)                        /*!< the input of CLA0SIGS1 is CLAIN1(PB3) */
#define CLA1SIGS1_CLAIN6                  CLA_SIGS1(8)                        /*!< the input of CLA1SIGS1 is CLAIN6(PB8) */
#define CLA2SIGS1_CLAIN2                  CLA_SIGS1(8)                        /*!< the input of CLA2SIGS1 is CLAIN2(PB4) */
#define CLA3SIGS1_CLAIN0                  CLA_SIGS1(8)                        /*!< the input of CLA3SIGS1 is CLAIN0(PA15) */
#define CLA4SIGS1_CLAIN1                  CLA_SIGS1(8)                        /*!< the input of CLA4SIGS1 is CLAIN1(PB3) */
#define CLA5SIGS1_CLAIN6                  CLA_SIGS1(8)                        /*!< the input of CLA5SIGS1 is CLAIN6(PB8) */
#define CLA6SIGS1_CLAIN2                  CLA_SIGS1(8)                        /*!< the input of CLA6SIGS1 is CLAIN2(PB4) */
#define CLA7SIGS1_CLAIN0                  CLA_SIGS1(8)                        /*!< the input of CLA7SIGS1 is CLAIN0(PA15) */

#define CLA0SIGS1_CLAIN3                  CLA_SIGS1(9)                        /*!< the input of CLA0SIGS1 is CLAIN3(PB5) */
#define CLA1SIGS1_CLAIN7                  CLA_SIGS1(9)                        /*!< the input of CLA1SIGS1 is CLAIN7(PB9) */
#define CLA2SIGS1_CLAIN3                  CLA_SIGS1(9)                        /*!< the input of CLA2SIGS1 is CLAIN3(PB5) */
#define CLA3SIGS1_CLAIN1                  CLA_SIGS1(9)                        /*!< the input of CLA3SIGS1 is CLAIN1(PB3) */
#define CLA4SIGS1_CLAIN3                  CLA_SIGS1(9)                        /*!< the input of CLA4SIGS1 is CLAIN3(PB5) */
#define CLA5SIGS1_CLAIN7                  CLA_SIGS1(9)                        /*!< the input of CLA5SIGS1 is CLAIN7(PB9) */
#define CLA6SIGS1_CLAIN3                  CLA_SIGS1(9)                        /*!< the input of CLA6SIGS1 is CLAIN3(PB5) */
#define CLA7SIGS1_CLAIN1                  CLA_SIGS1(9)                        /*!< the input of CLA7SIGS1 is CLAIN1(PB3) */

#define CLA0SIGS1_CLAIN5                  CLA_SIGS1(10)                       /*!< the input of CLA0SIGS1 is CLAIN5(PB7) */
#define CLA1SIGS1_CLAIN9                  CLA_SIGS1(10)                       /*!< the input of CLA1SIGS1 is CLAIN9(PB1) */
#define CLA2SIGS1_CLAIN10                 CLA_SIGS1(10)                       /*!< the input of CLA2SIGS1 is CLAIN10(PB2) */
#define CLA3SIGS1_CLAIN4                  CLA_SIGS1(10)                       /*!< the input of CLA3SIGS1 is CLAIN4(PB6) */
#define CLA4SIGS1_CLAIN5                  CLA_SIGS1(10)                       /*!< the input of CLA4SIGS1 is CLAIN5(PB7) */
#define CLA5SIGS1_CLAIN9                  CLA_SIGS1(10)                       /*!< the input of CLA5SIGS1 is CLAIN9(PB1) */
#define CLA6SIGS1_CLAIN10                 CLA_SIGS1(10)                       /*!< the input of CLA6SIGS1 is CLAIN10(PB2) */
#define CLA7SIGS1_CLAIN4                  CLA_SIGS1(10)                       /*!< the input of CLA7SIGS1 is CLAIN4(PB6) */

#define CLA0SIGS1_CLAIN6                  CLA_SIGS1(11)                       /*!< the input of CLA0SIGS1 is CLAIN6(PB9) */
#define CLA1SIGS1_CLAIN11                 CLA_SIGS1(11)                       /*!< the input of CLA1SIGS1 is CLAIN11(PA8) */
#define CLA2SIGS1_CLAIN11                 CLA_SIGS1(11)                       /*!< the input of CLA2SIGS1 is CLAIN11(PA8) */
#define CLA3SIGS1_CLAIN5                  CLA_SIGS1(11)                       /*!< the input of CLA3SIGS1 is CLAIN5(PB7) */
#define CLA4SIGS1_CLAIN6                  CLA_SIGS1(11)                       /*!< the input of CLA4SIGS1 is CLAIN6(PB9) */
#define CLA5SIGS1_CLAIN11                 CLA_SIGS1(11)                       /*!< the input of CLA5SIGS1 is CLAIN11(PA8) */
#define CLA6SIGS1_CLAIN11                 CLA_SIGS1(11)                       /*!< the input of CLA6SIGS1 is CLAIN11(PA8) */
#define CLA7SIGS1_CLAIN5                  CLA_SIGS1(11)                       /*!< the input of CLA7SIGS1 is CLAIN5(PB7) */

