frank0165/McuDspGit20250505/mcu_project__debug_fordsp/src/mcu/GDE501_fireware/Firmware/GD32E501_standard_peripheral/Include/gd32e501_cla.h
#define CLA0SIGS1_CLAIN9                  CLA_SIGS1(12)                       /*!< the input of CLA0SIGS1 is CLAIN9(PB1) */
#define CLA1SIGS1_CLAIN14                 CLA_SIGS1(12)                       /*!< the input of CLA1SIGS1 is CLAIN14(PA11) */
#define CLA2SIGS1_CLAIN12                 CLA_SIGS1(12)                       /*!< the input of CLA2SIGS1 is CLAIN12(PA9) */
#define CLA3SIGS1_CLAIN8                  CLA_SIGS1(12)                       /*!< the input of CLA3SIGS1 is CLAIN8(PB0) */
#define CLA4SIGS1_CLAIN9                  CLA_SIGS1(12)                       /*!< the input of CLA4SIGS1 is CLAIN9(PB1) */
#define CLA5SIGS1_CLAIN14                 CLA_SIGS1(12)                       /*!< the input of CLA5SIGS1 is CLAIN14(PA11) */
#define CLA6SIGS1_CLAIN12                 CLA_SIGS1(12)                       /*!< the input of CLA6SIGS1 is CLAIN12(PA9) */
#define CLA7SIGS1_CLAIN8                  CLA_SIGS1(12)                       /*!< the input of CLA7SIGS1 is CLAIN8(PB0) */
 
#define CLA0SIGS1_CLAIN11                 CLA_SIGS1(13)                       /*!< the input of CLA0SIGS1 is CLAIN11(PA8) */
#define CLA1SIGS1_CLAIN15                 CLA_SIGS1(13)                       /*!< the input of CLA1SIGS1 is CLAIN15(PA12) */
#define CLA2SIGS1_CLAIN13                 CLA_SIGS1(13)                       /*!< the input of CLA2SIGS1 is CLAIN13(PA10) */
#define CLA3SIGS1_CLAIN9                  CLA_SIGS1(13)                       /*!< the input of CLA3SIGS1 is CLAIN9(PB1) */
#define CLA4SIGS1_CLAIN11                 CLA_SIGS1(13)                       /*!< the input of CLA4SIGS1 is CLAIN11(PA8) */
#define CLA5SIGS1_CLAIN15                 CLA_SIGS1(13)                       /*!< the input of CLA5SIGS1 is CLAIN15(PA12) */
#define CLA6SIGS1_CLAIN13                 CLA_SIGS1(13)                       /*!< the input of CLA6SIGS1 is CLAIN13(PA10) */
#define CLA7SIGS1_CLAIN9                  CLA_SIGS1(13)                       /*!< the input of CLA7SIGS1 is CLAIN9(PB1) */

#define CLA0SIGS1_CLAIN13                 CLA_SIGS1(14)                       /*!< the input of CLA0SIGS1 is CLAIN13(PA10) */
#define CLA1SIGS1_CLAIN17                 CLA_SIGS1(14)                       /*!< the input of CLA1SIGS1 is CLAIN17(PF1) */
#define CLA2SIGS1_CLAIN18                 CLA_SIGS1(14)                       /*!< the input of CLA2SIGS1 is CLAIN18(PA0) */
#define CLA3SIGS1_CLAIN16                 CLA_SIGS1(14)                       /*!< the input of CLA3SIGS1 is CLAIN16(PF0) */
#define CLA4SIGS1_CLAIN13                 CLA_SIGS1(14)                       /*!< the input of CLA4SIGS1 is CLAIN13(PA10) */
#define CLA5SIGS1_CLAIN17                 CLA_SIGS1(14)                       /*!< the input of CLA5SIGS1 is CLAIN17(PF1) */
#define CLA6SIGS1_CLAIN18                 CLA_SIGS1(14)                       /*!< the input of CLA6SIGS1 is CLAIN18(PA0) */
#define CLA7SIGS1_CLAIN16                 CLA_SIGS1(14)                       /*!< the input of CLA7SIGS1 is CLAIN16(PF0) */

#define CLA0SIGS1_CLAIN15                 CLA_SIGS1(15)                       /*!< the input of CLA0SIGS1 is CLAIN15(PA12) */
#define CLA1SIGS1_CLAIN19                 CLA_SIGS1(15)                       /*!< the input of CLA1SIGS1 is CLAIN19(PA1) */
#define CLA2SIGS1_CLAIN19                 CLA_SIGS1(15)                       /*!< the input of CLA2SIGS1 is CLAIN19(PA1) */
#define CLA3SIGS1_CLAIN17                 CLA_SIGS1(15)                       /*!< the input of CLA3SIGS1 is CLAIN17(PF1) */
#define CLA4SIGS1_CLAIN15                 CLA_SIGS1(15)                       /*!< the input of CLA4SIGS1 is CLAIN15(PA12) */
#define CLA5SIGS1_CLAIN19                 CLA_SIGS1(15)                       /*!< the input of CLA5SIGS1 is CLAIN19(PA1) */
#define CLA6SIGS1_CLAIN19                 CLA_SIGS1(15)                       /*!< the input of CLA6SIGS1 is CLAIN19(PA1) */
#define CLA7SIGS1_CLAIN17                 CLA_SIGS1(15)                       /*!< the input of CLA7SIGS1 is CLAIN17(PF1) */

#define CLA0SIGS1_CLA4_ASYNC_OUT          CLA_SIGS_SIGS1_5|CLA_SIGS1(0)        /*!< the input of CLA0SIGS1 is CLA4_ASYNC_OUT */
#define CLA1SIGS1_CLA4_ASYNC_OUT          CLA_SIGS_SIGS1_5|CLA_SIGS1(0)        /*!< the input of CLA1SIGS1 is CLA4_ASYNC_OUT */
#define CLA2SIGS1_CLA4_ASYNC_OUT          CLA_SIGS_SIGS1_5|CLA_SIGS1(0)        /*!< the input of CLA2SIGS1 is CLA4_ASYNC_OUT */
#define CLA3SIGS1_CLA4_ASYNC_OUT          CLA_SIGS_SIGS1_5|CLA_SIGS1(0)        /*!< the input of CLA3SIGS1 is CLA4_ASYNC_OUT */
#define CLA4SIGS1_CLA4_ASYNC_OUT          CLA_SIGS_SIGS1_5|CLA_SIGS1(0)        /*!< the input of CLA4SIGS1 is CLA4_ASYNC_OUT */
#define CLA5SIGS1_CLA4_ASYNC_OUT          CLA_SIGS_SIGS1_5|CLA_SIGS1(0)        /*!< the input of CLA5SIGS1 is CLA4_ASYNC_OUT */
#define CLA6SIGS1_CLA4_ASYNC_OUT          CLA_SIGS_SIGS1_5|CLA_SIGS1(0)        /*!< the input of CLA6SIGS1 is CLA4_ASYNC_OUT */
#define CLA7SIGS1_CLA4_ASYNC_OUT          CLA_SIGS_SIGS1_5|CLA_SIGS1(0)        /*!< the input of CLA7SIGS1 is CLA4_ASYNC_OUT */

#define CLA0SIGS1_CLA5_ASYNC_OUT          CLA_SIGS_SIGS1_5|CLA_SIGS1(1)        /*!< the input of CLA0SIGS1 is CLA5_ASYNC_OUT */
#define CLA1SIGS1_CLA5_ASYNC_OUT          CLA_SIGS_SIGS1_5|CLA_SIGS1(1)        /*!< the input of CLA1SIGS1 is CLA5_ASYNC_OUT */
#define CLA2SIGS1_CLA5_ASYNC_OUT          CLA_SIGS_SIGS1_5|CLA_SIGS1(1)        /*!< the input of CLA2SIGS1 is CLA5_ASYNC_OUT */
#define CLA3SIGS1_CLA5_ASYNC_OUT          CLA_SIGS_SIGS1_5|CLA_SIGS1(1)        /*!< the input of CLA3SIGS1 is CLA5_ASYNC_OUT */
#define CLA4SIGS1_CLA5_ASYNC_OUT          CLA_SIGS_SIGS1_5|CLA_SIGS1(1)        /*!< the input of CLA4SIGS1 is CLA5_ASYNC_OUT */
#define CLA5SIGS1_CLA5_ASYNC_OUT          CLA_SIGS_SIGS1_5|CLA_SIGS1(1)        /*!< the input of CLA5SIGS1 is CLA5_ASYNC_OUT */
#define CLA6SIGS1_CLA5_ASYNC_OUT          CLA_SIGS_SIGS1_5|CLA_SIGS1(1)        /*!< the input of CLA6SIGS1 is CLA5_ASYNC_OUT */
#define CLA7SIGS1_CLA5_ASYNC_OUT          CLA_SIGS_SIGS1_5|CLA_SIGS1(1)        /*!< the input of CLA7SIGS1 is CLA5_ASYNC_OUT */

#define CLA1SIGS1_CLA6_ASYNC_OUT          CLA_SIGS_SIGS1_5|CLA_SIGS1(2)        /*!< the input of CLA1SIGS1 is CLA6_ASYNC_OUT */
#define CLA2SIGS1_CLA6_ASYNC_OUT          CLA_SIGS_SIGS1_5|CLA_SIGS1(2)        /*!< the input of CLA2SIGS1 is CLA6_ASYNC_OUT */
#define CLA3SIGS1_CLA6_ASYNC_OUT          CLA_SIGS_SIGS1_5|CLA_SIGS1(2)        /*!< the input of CLA3SIGS1 is CLA6_ASYNC_OUT */
#define CLA4SIGS1_CLA6_ASYNC_OUT          CLA_SIGS_SIGS1_5|CLA_SIGS1(2)        /*!< the input of CLA4SIGS1 is CLA6_ASYNC_OUT */
#define CLA5SIGS1_CLA6_ASYNC_OUT          CLA_SIGS_SIGS1_5|CLA_SIGS1(2)        /*!< the input of CLA5SIGS1 is CLA6_ASYNC_OUT */
#define CLA6SIGS1_CLA6_ASYNC_OUT          CLA_SIGS_SIGS1_5|CLA_SIGS1(2)        /*!< the input of CLA6SIGS1 is CLA6_ASYNC_OUT */
#define CLA7SIGS1_CLA6_ASYNC_OUT          CLA_SIGS_SIGS1_5|CLA_SIGS1(2)        /*!< the input of CLA7SIGS1 is CLA6_ASYNC_OUT */

#define CLA0SIGS1_CLA7_ASYNC_OUT          CLA_SIGS_SIGS1_5|CLA_SIGS1(3)        /*!< the input of CLA0SIGS1 is CLA7_ASYNC_OUT */
#define CLA1SIGS1_CLA7_ASYNC_OUT          CLA_SIGS_SIGS1_5|CLA_SIGS1(3)        /*!< the input of CLA1SIGS1 is CLA7_ASYNC_OUT */
#define CLA2SIGS1_CLA7_ASYNC_OUT          CLA_SIGS_SIGS1_5|CLA_SIGS1(3)        /*!< the input of CLA2SIGS1 is CLA7_ASYNC_OUT */
#define CLA3SIGS1_CLA7_ASYNC_OUT          CLA_SIGS_SIGS1_5|CLA_SIGS1(3)        /*!< the input of CLA3SIGS1 is CLA7_ASYNC_OUT */
#define CLA4SIGS1_CLA7_ASYNC_OUT          CLA_SIGS_SIGS1_5|CLA_SIGS1(3)        /*!< the input of CLA4SIGS1 is CLA7_ASYNC_OUT */
#define CLA5SIGS1_CLA7_ASYNC_OUT          CLA_SIGS_SIGS1_5|CLA_SIGS1(3)        /*!< the input of CLA5SIGS1 is CLA7_ASYNC_OUT */
#define CLA6SIGS1_CLA7_ASYNC_OUT          CLA_SIGS_SIGS1_5|CLA_SIGS1(3)        /*!< the input of CLA6SIGS1 is CLA7_ASYNC_OUT */
#define CLA7SIGS1_CLA7_ASYNC_OUT          CLA_SIGS_SIGS1_5|CLA_SIGS1(3)        /*!< the input of CLA7SIGS1 is CLA7_ASYNC_OUT */

